Lendo varias abas em arquivos excel

Import da biblioteca pandas

In [ ]:
# Biblioteca que possibilita a leitura e a manipulação de dados presentes em um arquivo
# excel.
import pandas as pd

Leitura padrão do pandas

In [ ]:
# Na leitura padrão do pandas, usamos a função read_excel para ler as tabelas presentes na
# planilha, porém, o read_excel lê apenas a primeira tabela que ele encontra na primeira aba
# do excel(primeira tabela da esquerda para a direita). Por conta disso, temos que passar outros
# argumentos na função para garantir que o read_excel encontre outras abas e tabelas. 
planilha = pd.read_excel('arquivo.xlsx')

# Ira mostrar as tabelas encontradas.
display(planilha)

    Vendedor  Vendas
0     Daniel     625
1       João     594
2    Natália     650
3   Henrique     862
4       Lira     452
5      Paula     139
6      Paulo     175
7   Gabriela     293
8      Kicia     529
9      Diego     507
10      Alon     705

Lendo uma planilha("aba") especifica, com indice de aba:

In [ ]:
# Para ler os dados de uma aba especifica, vamos passar como valor do
# argumento sheet_name o nome da aba que queremos ler os dados.
planilha = pd.read_excel('arquivo.xlsx', sheet_name='Planilha2')

display(planilha)

              Loja  Vendas
0          Niterói     625
1         Curitiba     594
2   Rio de Janeiro     650
3        São Paulo     862
4           Cuiabá     452
5           Palmas     139
6         Teresina     175
7           Recife     293
8   Santa Catarina     529
9           Manaus     507
10  Belo Horizonte     705

Lendo uma planilha ("aba") especifica, com indice da aba

In [ ]:
# Caso você não saiba o nome da aba que você precisa, basta você passar como 
# argumento o indice da aba para o argumento sheet_name. Observação: A xontagem
# no python começa a partir do 0.
planilha = pd.read_excel('arquivo.xlsx', sheet_name=3)

display(planilha)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,Vendedor,Vendas
7,NaN,NaN,NaN,NaN,NaN,NaN,Daniel,625
8,NaN,NaN,NaN,NaN,NaN,NaN,João,594
9,NaN,NaN,NaN,NaN,NaN,NaN,Natália,650
10,NaN,NaN,NaN,NaN,NaN,NaN,Henrique,862
11,NaN,NaN,NaN,NaN,NaN,NaN,Lira,452
12,NaN,NaN,NaN,NaN,NaN,NaN,Paula,139
13,NaN,NaN,NaN,NaN,NaN,NaN,Paulo,175
14,NaN,NaN,NaN,NaN,NaN,NaN,Gabriela,293
15,NaN,NaN,NaN,NaN,NaN,NaN,Kicia,529
16,NaN,NaN,NaN,NaN,NaN,NaN,Diego,507
17,NaN,NaN,NaN,NaN,NaN,NaN,Alon,705

Selecionando as colunas pelo indice

In [ ]:
# Além de especificarmos a aba, também podemos especificar as colunas que
# queremos acessar. Para isso, usamos o argumento usecols que recebe uma
# lista de valores numéricos que representam os indices da colunas
planilha = pd.read_excel('arquivo.xlsx', sheet_name='Planilha3', usecols=[5, 6])

display(planilha)

              Loja  Vendas.1
0          Niterói       625
1         Curitiba       594
2   Rio de Janeiro       650
3        São Paulo       862
4           Cuiabá       452
5           Palmas       139
6         Teresina       175
7           Recife       293
8   Santa Catarina       529
9           Manaus       507
10  Belo Horizonte       705

Selecionando as colunas pelo "nome da coluna"

In [ ]:
# Também podemos especificar as colunas através do nome delas (que também
# podem ser representadas em intervalos, como fizemos nesse caso). Para
# isso basta passar como valor do argumento usecols, o nome ou o intervalo
# que você quer acessar.
planilha = pd.read_excel('arquivo.xlsx', sheet_name='Planilha3', usecols="F:G")

display(planilha)

              Loja  Vendas.1
0          Niterói       625
1         Curitiba       594
2   Rio de Janeiro       650
3        São Paulo       862
4           Cuiabá       452
5           Palmas       139
6         Teresina       175
7           Recife       293
8   Santa Catarina       529
9           Manaus       507
10  Belo Horizonte       705

Buscando todas as informações de um arquivo

In [ ]:
# Para coletarmos todos os dados de todas as abas, precisamos passar
# como valor do argumento sheet_name o valor None. Dessa forma, não
# especificaremos colunas e a função read_excel retornara um dicionário
# com todos os dados da planilha, onde as abas serão as chaves, e o valor
# das tabelas serão os valores do dicionário, por exemplo, a aba "Planilha1"
# será a chave de acesso para os valores presentes na aba.
planilha = pd.read_excel('arquivo.xlsx', sheet_name=None)

display(planilha)

{'Planilha1':     Vendedor  Vendas
 0     Daniel     625
 1       João     594
 2    Natália     650
 3   Henrique     862
 4       Lira     452
 5      Paula     139
 6      Paulo     175
 7   Gabriela     293
 8      Kicia     529
 9      Diego     507
 10      Alon     705,
 'Planilha2':               Loja  Vendas
 0          Niterói     625
 1         Curitiba     594
 2   Rio de Janeiro     650
 3        São Paulo     862
 4           Cuiabá     452
 5           Palmas     139
 6         Teresina     175
 7           Recife     293
 8   Santa Catarina     529
 9           Manaus     507
 10  Belo Horizonte     705,
 'Planilha3':     Vendedor  Vendas  Unnamed: 2  Unnamed: 3  Unnamed: 4            Loja  \
 0     Daniel     625         NaN         NaN         NaN         Niterói
 1       João     594         NaN         NaN         NaN        Curitiba
 2    Natália     650         NaN         NaN         NaN  Rio de Janeiro
 3   Henrique     862         NaN         NaN         NaN       São Paulo
 4       Lira     452         NaN         NaN         NaN          Cuiabá
 5      Paula     139         NaN         NaN         NaN          Palmas
 6      Paulo     175         NaN         NaN         NaN        Teresina
 7   Gabriela     293         NaN         NaN         NaN          Recife
 8      Kicia     529         NaN         NaN         NaN  Santa Catarina
 9      Diego     507         NaN         NaN         NaN          Manaus
 10      Alon     705         NaN         NaN         NaN  Belo Horizonte

     Vendas.1
 0        625
 1        594
 2        650
 3        862
 4        452
 5        139
 6        175
 7        293
 8        529
 9        507
 10       705  ,
 'Planilha4':     Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5  \
 0          NaN         NaN         NaN         NaN         NaN         NaN
 1          NaN         NaN         NaN         NaN         NaN         NaN
 2          NaN         NaN         NaN         NaN         NaN         NaN
 3          NaN         NaN         NaN         NaN         NaN         NaN
 4          NaN         NaN         NaN         NaN         NaN         NaN
 5          NaN         NaN         NaN         NaN         NaN         NaN
 6          NaN         NaN         NaN         NaN         NaN         NaN
 7          NaN         NaN         NaN         NaN         NaN         NaN
 8          NaN         NaN         NaN         NaN         NaN         NaN
 9          NaN         NaN         NaN         NaN         NaN         NaN
 10         NaN         NaN         NaN         NaN         NaN         NaN
 11         NaN         NaN         NaN         NaN         NaN         NaN
 12         NaN         NaN         NaN         NaN         NaN         NaN
 13         NaN         NaN         NaN         NaN         NaN         NaN
 14         NaN         NaN         NaN         NaN         NaN         NaN
 15         NaN         NaN         NaN         NaN         NaN         NaN
 16         NaN         NaN         NaN         NaN         NaN         NaN
 17         NaN         NaN         NaN         NaN         NaN         NaN

    Unnamed: 6 Unnamed: 7
 0         NaN        NaN
 1         NaN        NaN
 2         NaN        NaN
 3         NaN        NaN
 4         NaN        NaN
 5         NaN        NaN
 6    Vendedor     Vendas
 7      Daniel        625
 8        João        594
 9     Natália        650
 10   Henrique        862
 11       Lira        452
 12      Paula        139
 13      Paulo        175
 14   Gabriela        293
 15      Kicia        529
 16      Diego        507
 17       Alon        705  ,
 'Planilha5':           Vendedor  Vendas
 0           Daniel     625
 1             João     594
 2          Natália     650
 3         Henrique     862
 4             Lira     452
 5            Paula     139
 6            Paulo     175
 7         Gabriela     293
 8            Kicia     529
 9            Diego     507
 10            Alon     705
 11             NaN     NaN
 12            Loja  Vendas
 13         Niterói     625
 14        Curitiba     594
 15  Rio de Janeiro     650
 16       São Paulo     862
 17          Cuiabá     452
 18          Palmas     139
 19        Teresina     175
 20          Recife     293
 21  Santa Catarina     529
 22          Manaus     507
 23  Belo Horizonte     705}

Buscando informações de uma tabela fora da célula "A1"

Maneira padrão que não funciona

In [ ]:
# Como vimos anteriormente, o read_excel por padrão lê apenas a primeira tabela
# da esquerda para a direita, para resolver isso, aprendemos a utiliza o argumento
# sheet_name e usecols, porém eles não são o suficiente quando as linhas estão distantes
# da célula A1, ou seja, distantes do "radar de leitura do read_excel". Quando isso acontece,
# o read_excel retorna valores nulos nas linhas que ele não identificou.
planilha = pd.read_excel('arquivo.xlsx', sheet_name='Planilha4')

display(planilha)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,Vendedor,Vendas
7,NaN,NaN,NaN,NaN,NaN,NaN,Daniel,625
8,NaN,NaN,NaN,NaN,NaN,NaN,João,594
9,NaN,NaN,NaN,NaN,NaN,NaN,Natália,650
10,NaN,NaN,NaN,NaN,NaN,NaN,Henrique,862
11,NaN,NaN,NaN,NaN,NaN,NaN,Lira,452
12,NaN,NaN,NaN,NaN,NaN,NaN,Paula,139
13,NaN,NaN,NaN,NaN,NaN,NaN,Paulo,175
14,NaN,NaN,NaN,NaN,NaN,NaN,Gabriela,293
15,NaN,NaN,NaN,NaN,NaN,NaN,Kicia,529
16,NaN,NaN,NaN,NaN,NaN,NaN,Diego,507
17,NaN,NaN,NaN,NaN,NaN,NaN,Alon,705

Como resolver esse problema

In [ ]:
# Para resolver esse problema, uma das alternativas é fazer o read_excel 
# ignorar as linhas que não contém os dados da aba (tabela de valores).
# Dessa forma ele começara a ler o arquivo a partir da existência dos 
# dados, para isso usaremos o argumento skiprows que recebe um valor inteiro
# que irá indicar a quantidade de linhas que o read_excel irá pular
# na hora da leitura
planilha = pd.read_excel('arquivo.xlsx', sheet_name='Planilha4', usecols="G:H",skiprows=7)

display(planilha)

    Vendedor  Vendas
0     Daniel     625
1       João     594
2    Natália     650
3   Henrique     862
4       Lira     452
5      Paula     139
6      Paulo     175
7   Gabriela     293
8      Kicia     529
9      Diego     507
10      Alon     705

Especificando a quantidade de linhas que o read_excel deve ler

In [ ]:
# Para especificar a quantidade de linhas que a função deve ler, devemos passar
# como argumento o nrows que recebe um valor inteiro que indica a quantidade
# de linhas que devem ser lidas
planilha = pd.read_excel('arquivo.xlsx', sheet_name='Planilha5', nrows=11)

display(planilha)

    Vendedor  Vendas
0     Daniel     625
1       João     594
2    Natália     650
3   Henrique     862
4       Lira     452
5      Paula     139
6      Paulo     175
7   Gabriela     293
8      Kicia     529
9      Diego     507
10      Alon     705

Buscando apenas as informações desejadas (quando usamos o None no sheet_name)

In [ ]:
# Quando o read_excel retorna um dicionário (usando o none no argumento sheet 
# name), podemos acessar os valores de uma aba especifica usando o nome
# da chave que contém os valores (nome da aba que queremos acessar)
planilha = pd.read_excel('arquivo.xlsx', sheet_name=None)

display(planilha['Planilha2'])

              Loja  Vendas
0          Niterói     625
1         Curitiba     594
2   Rio de Janeiro     650
3        São Paulo     862
4           Cuiabá     452
5           Palmas     139
6         Teresina     175
7           Recife     293
8   Santa Catarina     529
9           Manaus     507
10  Belo Horizonte     705